[
	{
		"title": "Friday Night Steelers Six Pack of questions and open thread: Colts/Christmas Week Edition",
		"excerpt": "There is always something to talk about when it comes to the black-and-gold! It’s Friday again, and Christmas, so it’s time for the six pack of questions. It seems as if Jeff and Dave come to a consensus in cutting to the chase... This week, I, Jeff, will be tasked with the questions up for discussion. The rules are still the same... Quick rundown of the ground rules. I’ll ask at least four questions strictly related to the Steelers. The rest of the questions could be about anything. Be respectful. Have fun talking about the...",
		"link": "https://www.msn.com/en-us/news/us/friday-night-steelers-six-pack-of-questions-and-open-thread-colts-christmas-week-edition/ar-BB1ceyqH"
	},
	{
		"title": "Injury Report: Ulysees Gilbert to IR, 4 others questionable for Sunday",
		"excerpt": "On a positive note, Stephon Tuitt returned to practice on Friday. The Steelers finished up their preparation on Friday for their Week 15 matchup against the Indianapolis Colts where they look to end their three-game losing streak. In the final injury report for the Steelers for Week 16 courtesy of the Steelers PR Department, the Steelers have 4 players listed as questionable for Sunday. Steelers PR Department The Steelers made a roster move just minutes after releasing the injury report placing Ulysees Gilbert III on the...",
		"link": "https://www.msn.com/en-us/sports/nfl/injury-report-ulysees-gilbert-to-ir-4-others-questionable-for-sunday/ar-BB1ceiX4"
	},
	{
		"title": "NFL Odds and Predictions: Picking all the Week 16 games against the spread",
		"excerpt": "Several of the BTSC staff pick all the NFL games both against the spread and over/under point totals The 2020 NFL season has made it through 15 weeks, and the Pittsburgh Steelers have already qualified for the postseason for the first time in three years. Unfortunately, their quality of play as of late has most fans concerned as they prepare for the playoffs with only 2 games remaining. For the 2020 NFL season, six of the BTSC staff (a group I have affectionately named the “BTSC Super Six”) have signed up to pick every game against the...",
		"link": "https://www.behindthesteelcurtain.com/2020/12/25/22199374/nfl-odds-and-predictions-picking-all-the-week-16-games-against-the-spread-pittsburgh-steelers"
	},
	{
		"title": "3 games to watch in Week 16 which give perspective to the 2020 Steelers",
		"excerpt": "The only thing the Steelers should be worried about is their own game, but here are 3 other games to watch just in case. The Pittsburgh Steelers are looking to find something to get them back on track to finsih up the 2020 regular season. With only 2 games left, it is same to say the Steelers’ game is the only one that matters this week. But since that would make for a boring article, let’s look at 3 other games this week which might be important going forward. At the suggestion of one of our faithful BTSC community members, I’m going to...",
		"link": "https://www.msn.com/en-us/sports/nfl/3-games-to-watch-in-week-16-which-give-perspective-to-the-2020-steelers/ar-BB1cebpf"
	},
	{
		"title": "Blake Bortles quotes Simon and Garfunkel in return to Rams",
		"excerpt": "With the news that Rams quarterback Jared Goff will undergo thump surgery and may or may not be back in time for the playoffs, Sean McVay’s team had to do something. They’re planning to start John Wolford, the former star of the Arizona Hotshots of the Alliance of American Football, where he led that short-lived league in passing touchdowns.",
		"link": "https://www.msn.com/en-us/sports/nfl/blake-bortles-quotes-simon-and-garfunkel-in-return-to-rams/ar-BB1ciN24"
	}
]
